In [1]:
import numpy as np
import pandas as pd
from sklearn import model_selection
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

training=pd.read_csv(r'C:\Users\uvans\Downloads\0000000000002429_training_titanic_x_y_train.csv')

In [2]:

training=pd.read_csv(r'C:\Users\uvans\Downloads\0000000000002429_training_titanic_x_y_train.csv')

In [3]:
training.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [5]:
training.shape

(668, 11)

In [6]:
training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    668 non-null    int64
 1   Name      668 non-null    object
 2   Sex       668 non-null    object
 3   Age       536 non-null    float64
 4   SibSp     668 non-null    int64
 5   Parch     668 non-null    int64
 6   Ticket    668 non-null    object
 7   Fare      668 non-null    float64
 8   Cabin     154 non-null    object
 9   Embarked  667 non-null    object
 10  Survived  668 non-null    int64
dtypes: float64(2), int64(4), object(5)
memory usage: 57.5+ KB

In [7]:
training.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [8]:
# replacing the missing values in "Age" column with mean value
training['Age'].fillna(training['Age'].mean(), inplace=True)

In [9]:
# finding the mode value of "Embarked" column
print(training['Embarked'].mode())

0    S
Name: Embarked, dtype: object

In [30]:
# replacing the missing values in "Embarked" column with mode value
training['Embarked'].fillna(training['Embarked'].mode()[0], inplace=True)

# check the number of missing values in each column
training.isnull().sum()

In [16]:
training.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  668.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   12.753571    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   23.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.700560    0.000000    0.000000   14.750000    0.000000
75%      3.000000   35.000000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [32]:
training.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [17]:
# finding the number of people survived and not survived
training['Survived'].value_counts()

Survived
0    399
1    269
Name: count, dtype: int64

In [18]:
training['Sex'].value_counts()

Sex
male      427
female    241
Name: count, dtype: int64

In [20]:
training['Embarked'].value_counts()

Embarked
S    485
C    133
Q     50
Name: count, dtype: int64

In [21]:
training.replace({'Sex':{'male':0,'female':1}, 'Embarked':{'S':0,'C':1,'Q':2}}, inplace=True)
training.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",1,29.00000,1,0,228414,26.000,0,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",0,29.70056,0,0,A/5 2466,8.050,0,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",0,39.00000,0,0,250655,26.000,0,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",1,29.00000,0,4,349909,21.075,0,0
4,3,"Sutehall, Mr. Henry Jr",0,25.00000,0,0,SOTON/OQ 392076,7.050,0,0

In [24]:
X = training.drop(columns = ['Name','Ticket','Survived'],axis=1)
Y = training['Survived']

In [25]:
X

     Pclass  Sex       Age  SibSp  Parch     Fare  Embarked
0         2    1  29.00000      1      0  26.0000         0
1         3    0  29.70056      0      0   8.0500         0
2         2    0  39.00000      0      0  26.0000         0
3         3    1  29.00000      0      4  21.0750         0
4         3    0  25.00000      0      0   7.0500         0
..      ...  ...       ...    ...    ...      ...       ...
663       2    1  17.00000      0      0  10.5000         0
664       3    0  29.70056      0      0   7.7500         2
665       3    0  32.00000      0      0  56.4958         0
666       3    1  22.00000      0      0   9.8375         0
667       3    1  29.70056      1      0  15.5000         2

[668 rows x 7 columns]

In [26]:
Y

0      1
1      0
2      0
3      0
4      0
      ..
663    1
664    0
665    1
666    0
667    1
Name: Survived, Length: 668, dtype: int64

In [35]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size=0.2, random_state=2)

In [36]:
print(X.shape, X_train.shape, X_test.shape)

(668, 7) (534, 7) (134, 7)

In [37]:
model = LogisticRegression()
MAIN1=model.fit(X_train, Y_train)

C:\Users\uvans\anaconda3\Lib\site-packages\sklearn\linear_model\_logistic.py:460: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [38]:
X_train_prediction = model.predict(X_train)

In [39]:
print(X_train_prediction)

[0 1 1 1 0 0 0 0 1 1 1 0 1 0 0 0 0 1 0 0 0 1 0 1 1 0 1 1 1 0 0 1 0 0 0 1 0
 1 0 0 0 1 0 1 1 0 0 0 1 1 0 0 0 1 0 0 0 0 1 1 0 0 0 1 0 0 1 0 0 0 0 0 0 0
 0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0
 0 0 0 0 0 1 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 1 0 0 0 1 0 0 0 0 1 1 1 0 0
 1 1 0 1 1 0 1 0 0 0 0 1 1 0 1 1 0 1 1 1 1 1 0 0 0 0 1 1 0 1 0 0 1 0 1 0 0
 1 0 1 0 0 0 1 1 0 1 1 0 0 1 1 0 0 1 0 0 1 1 1 0 0 1 1 1 0 0 0 1 0 0 1 0 0
 0 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 1 0 0 0 1 1 0 0 1 1 1 0 0 1 1 0 0 0
 0 0 0 1 0 1 0 1 0 1 0 0 0 0 0 1 0 1 0 0 0 1 0 1 1 0 1 0 0 0 1 0 0 1 1 0 1
 0 0 0 1 1 1 0 0 0 0 1 0 0 0 0 0 0 1 0 1 0 0 0 0 0 1 1 0 0 0 1 0 0 0 1 0 0
 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 1 0 0 1 0 0 0 0 0 0 1 1 0 0 0 1 0 0 0 0 0 1
 1 1 0 1 0 0 0 1 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 0 0 0 0 0 1 1 0 0 1 1 0 1
 1 1 0 0 1 0 0 0 0 0 0 1 1 0 1 1 0 1 0 0 0 0 0 1 1 0 0 0 0 1 0 1 0 1 0 1 1
 1 0 1 1 1 0 0 1 1 0 1 0 0 0 0 0 1 0 1 0 1 0 1 1 0 0 0 0 0 0 0 0 1 0 0 0 0
 1 0 0 1 1 0 1 0 1 1 0 0 0 1 1 0 1 1 0 1 1 0 0 1 0 0 0 1 0 0 0 0 0 1 0 0 1
 0 0 0 1 0 0 0 1 1 1 1 1 0 0 1 0]

In [41]:
from sklearn.metrics import accuracy_score
training_data_accuracy = accuracy_score(Y_train, X_train_prediction)
print('Accuracy score of training data : ', training_data_accuracy)

Accuracy score of training data :  0.7846441947565543

In [42]:
# accuracy on test data
X_test_prediction = model.predict(X_test)

In [43]:
test_data_accuracy = accuracy_score(Y_test, X_test_prediction)
print('Accuracy score of test data : ', test_data_accuracy)

Accuracy score of test data :  0.8208955223880597

In [59]:
testing=pd.read_csv(r'C:\Users\uvans\Downloads\logistictestingfinal.csv')
testingpd=pd.DataFrame(testing)
testingpd
Y_prediction=model.predict(testingpd)

In [60]:
Y_prediction

array([0, 1], dtype=int64)

In [61]:
testingpd

   Pclass  Sex  Age  SibSp  Parch     Fare  Embarked
0       2    0    8      1      1  36.7500         0
1       1    1   49      0      0  25.9292         0